class BooksCollectorData:
    books = [
        ['Дюна', 'Фантастика'],
        ['Кладбище домашних животных', 'Ужасы'],
        ['Клуб убийств по четвергам', 'Детективы'],
        ['Простоквашино', 'Мультфильмы'],
        ['Комедии', 'Комедии']
    ]
    kids_books = [
        ['kids_book1','Фантастика'],
        ['kids_book2','Мультфильмы'],
        ['kids_book3','Комедии'],
    ]
    not_kids_books = [
        ['not_kids_book1', 'Ужасы'],
        ['not_kids_book2', 'Детективы']
    ]
    invalid_genres = [
        ['invalid_book1','Романтика'],
        ['invalid_book2','детективы'],
        ['invalid_book3',' ']
    ]
    genres = ['Фантастика', 'Ужасы', 'Детективы', 'Мультфильмы', 'Комедии']
    too_long_titles = ['Странная история доктора Джекила и мистер', 'Странная история доктора Джекила и мистера']
    long_enough_titles = ['Странная история доктора Джекила и мисте', 'Странная история доктора Джекила и мист', 'С']
